Revit 2027 API
BuiltInFailures.StairRampFailures.NoRunsRamp Property
 Ramp has no Runs. Can't create Ramp.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRunsRamp { get; }
Public Shared ReadOnly Property NoRunsRamp As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRunsRamp {
	FailureDefinitionId^ get ();
}
static member NoRunsRamp : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace